[
  {
    "source": {
      "id": null,
      "name": "Slashdot.org"
    },
    "author": "msmash",
    "title": "How Decline of Indian Vultures Led To 500,000 Human Deaths",
    "description": "An anonymous reader shares a report: Once upon a time, the vulture was an abundant and ubiquitous bird in India. The scavenging birds hovered over sprawling landfills, looking for cattle carcasses. Sometimes they would alarm pilots by getting sucked into jet …",
    "url": "https://news.slashdot.org/story/24/07/30/1521236/how-decline-of-indian-vultures-led-to-500000-human-deaths",
    "urlToImage": "https://a.fsdn.com/sd/topics/earth_64.png",
    "publishedAt": "2024-07-30T15:22:00Z",
    "content": "Once upon a time, the vulture was an abundant and ubiquitous bird in India. The scavenging birds hovered over sprawling landfills, looking for cattle carcasses. Sometimes they would alarm pilots by g… [+1520 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "UPI.com"
    },
    "author": "Clyde Hughes",
    "title": "Palestinian Health Ministry finds polio in Gaza sewage water",
    "description": "The Palestinian Ministry of Health said on Thursday that sewage samples taken in Gaza found the virus that causes polio, presenting the latest challenge for ...",
    "url": "https://www.upi.com/Top_News/World-News/2024/07/19/Palestinian-health-polio-found/6101721386831/",
    "urlToImage": "https://media.zenfs.com/en/united_press_international_articles_356/739a48dc2042c1610bb33d8253a6246e",
    "publishedAt": "2024-07-19T11:50:35Z",
    "content": "July 19 (UPI) -- The Palestinian Ministry of Health said on Thursday that sewage samples taken in Gaza found the virus that causes polio. The ministry said the samples were taken in conjunction with… [+1647 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "BBC News"
    },
    "author": null,
    "title": "WHO 'extremely worried' about possible Gaza polio outbreak",
    "description": "Traces of the highly infectious virus were found in sewage samples from two sites a month ago.",
    "url": "https://www.bbc.com/news/articles/crgrxjn9rkpo",
    "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/1996/live/4a46a110-48e8-11ef-b5b4-9ff9cfc78a6d.jpg",
    "publishedAt": "2024-07-23T11:34:59Z",
    "content": "The World Health Organization is extremely worried about the possibility of an outbreak of the highly infectious polio virus in Gaza after traces were found in wastewater. Dr Ayadil Saparbekov, head… [+2916 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Christien Kafton",
    "title": "Dog controversy brews at San Francisco park",
    "description": "There is a battle brewing over a San Francisco park between dog owners and the city. There are signs at all the entrances of Jackson Playground; no dogs are ...",
    "url": "https://www.yahoo.com/news/dog-controversy-brews-san-francisco-042550697.html",
    "urlToImage": "https://media.zenfs.com/en/ktvu_fox_local_articles_961/05482febb07a276e237d88714b42fec6",
    "publishedAt": "2024-07-19T04:25:50Z",
    "content": "SAN FRANCISCO - There is a battle brewing over a San Francisco park between dog owners and the city. There are signs at all the entrances of Jackson Playground; no dogs are allowed on athletic fields… [+2417 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Sarah Ferguson, UNICEF USA, Sarah Ferguson, UNICEF USA https://www.forbes.com/sites/unicefusa/people/sarahferguson1/",
    "title": "Children Caught In Water And Sanitation Crisis In Gaza Strip",
    "description": "Some 1.8 million people — including more than 900,000 children — in the Gaza Strip require some form of humanitarian water, sanitation and hygiene (WASH) assistance.",
    "url": "https://www.forbes.com/sites/unicefusa/2024/07/23/children-caught-in-water-and-sanitation-crisis-in-gaza-strip/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/669e44ecd8657234d6e31ddd/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-07-23T11:33:00Z",
    "content": "Some 1.8 million people including more than 900,000 children in the Gaza Strip require some form of humanitarian water, sanitation and hygiene (WASH) assistance. Children pass through a waste dump … [+5075 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Gothamist"
    },
    "author": "Giulia Heyward",
    "title": "What it takes to clean NYC’s streets after the July 4 celebrations",
    "description": "New York City sanitation workers. Around 18 mechanical brooms, 12 reloader collection trucks and 50 people on manual brooms were deployed, according to the city’s chief of cleaning operations. [ more › ]",
    "url": "https://gothamist.com/news/what-it-takes-to-clean-nycs-streets-after-the-july-4-celebrations",
    "urlToImage": "https://api-prod.gothamist.com/images/340330/fill-1200x650|format-webp|webpquality-85/",
    "publishedAt": "2024-07-06T14:03:00Z",
    "content": "Fireworks displays set the skies ablaze on Thursday night as New York City celebrated the July 4 holiday. But as New Yorkers slept off their Independence Day libations, scores of sanitation workers … [+2188 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Scientific American"
    },
    "author": "Jeffery DelViscio, Kelso Harper, Tulika Bose, Michael Lester",
    "title": "How Science Can Defeat Witchcraft Fears in Papua New Guinea",
    "description": "Belief in witchcraft and sorcery is deeply rooted in Papua New Guinea's culture and history, but it can lead to violence, particularly against women. Local public health experts are working to end this violence through education.",
    "url": "https://www.scientificamerican.com/video/how-science-can-defeat-witchcraft-fears-in-papua-new-guinea/",
    "urlToImage": "https://static.scientificamerican.com/dam/m/7307c1ad0c5f5a22/original/Papua-New-Guinea-Dancer.jpg?w=1200",
    "publishedAt": "2024-07-11T14:00:00Z",
    "content": "This film is part of “Innovations In: Health Equity,” an editorially independent special report that was produced with financial support from Takeda Pharmaceuticals. TRANSCRIPT Jesse Irie: In Papua… [+6630 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Yanko Design"
    },
    "author": "Pooja Khanna Tyagi",
    "title": "The Architectural Heritage of the Mesopotamian Civilization",
    "description": "The Architectural Heritage of the Mesopotamian CivilizationMesopotamian architecture, born in the region between the Tigris and Euphrates rivers, takes its name from the Greek phrase “the land between the rivers. The...",
    "url": "https://www.yankodesign.com/2024/07/22/the-architectural-heritage-of-the-mesopotamian-civilization/",
    "urlToImage": "https://www.yankodesign.com/images/design_news/2024/07/auto-draft/00-mesopotamian-arch.jpeg",
    "publishedAt": "2024-07-22T11:40:11Z",
    "content": "Mesopotamian architecture, born in the region between the Tigris and Euphrates rivers, takes its name from the Greek phrase “the land between the rivers. The Mesopotamian civilization is also known a… [+8515 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Scientific American"
    },
    "author": "Rachel Feltman, Fonda Mwangi, Jeffery DelViscio",
    "title": "Cocaine Sharks, Komodo Teeth and Record-Breaking Heat",
    "description": "We cover extreme weather, cocaine sharks and komodo dragons with iron-tipped teeth in this week’s news roundup.",
    "url": "https://www.scientificamerican.com/podcast/episode/cocaine-sharks-komodo-teeth-and-record-breaking-heat/",
    "urlToImage": "https://static.scientificamerican.com/dam/m/450fc996fe659a91/original/SQ-Monday-EP-Art.png?w=1200",
    "publishedAt": "2024-07-29T10:00:00Z",
    "content": "Rachel Feltman: Happy Monday, listeners! Let’s kick off the week by catching up on the latest science news. For Scientific American’s Science Quickly, I’m Rachel Feltman. Monday, July 22, topped the… [+9598 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "MIT Technology Review"
    },
    "author": "Rhiannon Williams",
    "title": "The Download: robot-packed meals, and the looming fertility crisis",
    "description": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. Robot-packed meals are coming to the frozen-food aisle What’s happening: Advances in artificial intelligence are coming t…",
    "url": "https://www.technologyreview.com/2024/07/12/1094889/the-download-robot-packed-meals-and-the-looming-fertility-crisis/",
    "urlToImage": "https://wp.technologyreview.com/wp-content/uploads/2024/07/food-prep-robot.jpg?resize=1200,600",
    "publishedAt": "2024-07-12T12:10:00Z",
    "content": "Whats happening: Advances in artificial intelligence are coming to your freezer, in the form of robot-assembled prepared meals. Chef Robotics, a San Francisco-based startup, has launched a system of … [+1553 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cambridge.org"
    },
    "author": null,
    "title": "Human parasites in the Roman World: health consequences of conquering an empire",
    "description": "Human parasites in the Roman World: health consequences of conquering an empire - Volume 144 Issue 1",
    "url": "https://www.cambridge.org/core/journals/parasitology/article/human-parasites-in-the-roman-world-health-consequences-of-conquering-an-empire/6464BDBB5D4B8EC0B08C503B6ECD1B7B",
    "urlToImage": "https://static.cambridge.org/covers/PAR_0_0_0/parasitology.jpg?send-full-size-image=true",
    "publishedAt": "2024-07-20T15:46:56Z",
    "content": "INTRODUCTION The Romans When a cultural group overruns a large area or territory and spreads its ideas and philosophy, we might see changes in the state of human health as a consequence. The Roma… [+45053 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Phys.Org"
    },
    "author": "Science X",
    "title": "Energy efficiency may also keep rodents at bay",
    "description": "Sealing leaky windows, filling gaps in doors, and installing efficient insulation will not only decrease wasteful energy usage, it also may reduce rodent infestations, a new study recently published in Environmental Research Letters found.",
    "url": "https://phys.org/news/2024-07-energy-efficiency-rodents-bay.html",
    "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/2-mouse.jpg",
    "publishedAt": "2024-07-18T19:04:35Z",
    "content": "Sealing leaky windows, filling gaps in doors, and installing efficient insulation will not only decrease wasteful energy usage, it also may reduce rodent infestations, a new study recently published … [+4077 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Gothamist"
    },
    "author": "Jaclyn Jeffrey-Wilensky",
    "title": "2 NYC lawmakers say their names were used in Mayor Adams' resource request form without their knowledge",
    "description": "City Council Speaker Adrienne Adams, who has been an outspoken critic of the mayor's form for elected officials, said his administration had submitted a copy of the form in her name. Many lawmakers have used the form. Others have refused. [ more › ]",
    "url": "https://gothamist.com/news/whos-using-mayor-adams-controversial-request-form-some-nyc-electeds-say-not-me",
    "urlToImage": "https://api-prod.gothamist.com/images/346189/fill-1200x650|format-webp|webpquality-85/",
    "publishedAt": "2024-07-18T15:26:00Z",
    "content": "Most members of the New York City Council appear to be using Mayor Eric Adams much-maligned online form to request resources and meetings with city agencies, despite dozens of lawmakers complaints ab… [+7149 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "HYPEBEAST"
    },
    "author": "info@hypebeast.com (Hypebeast)",
    "title": "Roborock Collaborated with Artist Timothy Goodman to Unveil the Qrevo Pro Robotic Vacuum",
    "description": "Roborock has made tidying up your home easier than ever before with intuitive products that take care of the dirty work for you — at affordable prices appealing to new users, families, and more. Bringing innovation to home cleaning devices, the brand has crea…",
    "url": "https://hypebeast.com/2024/7/roborock-collaboration-with-artist-timothy-goodman-qrevo-pro-robotic-vaccum",
    "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2024%2F07%2F16%2FRoborock-Timothy-Collab-TW.jpg?w=1080&cbr=1&q=90&fit=max",
    "publishedAt": "2024-07-18T17:51:33Z",
    "content": "Roborock has made tidying up your home easier than ever before with intuitive products that take care of the dirty work for you at affordable prices appealing to new users, families, and more. Bringi… [+2609 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "MIT Technology Review"
    },
    "author": "Jessica Hamzelou",
    "title": "IVF alone can’t save us from a looming fertility crisis",
    "description": "This article first appeared in The Checkup, MIT Technology Review’s weekly biotech newsletter. To receive it in your inbox every Thursday, and read articles like this first, sign up here.  I’ve just learned that July 11 is World Population Day. There are over…",
    "url": "https://www.technologyreview.com/2024/07/12/1094876/ivf-alone-cant-save-us-from-a-looming-fertility-crisis/",
    "urlToImage": "https://wp.technologyreview.com/wp-content/uploads/2024/07/GettyImages-120906801.jpg?resize=1200,600",
    "publishedAt": "2024-07-12T09:00:00Z",
    "content": "But plenty of scientists are incredibly worried about just that. Improvements in health care and sanitation are helping us all lead longer lives. But were not having enough children to support us as … [+2143 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Vox"
    },
    "author": "Dylan Scott",
    "title": "These reviled birds of prey literally save people’s lives",
    "description": "As a young man in the 1990s, walking to school in New Delhi, Anant Sudarshan would watch the vultures perched along telephone wires, waiting for the discards of nearby leather tanning factories. So when the birds started to disappear, he couldn’t help but not…",
    "url": "https://www.vox.com/future-perfect/364277/india-vultures-human-health-deaths-study",
    "urlToImage": "https://platform.vox.com/wp-content/uploads/sites/2/2024/08/gettyimages-1241170086.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2024-08-01T18:03:46Z",
    "content": "As a young man in the 1990s, walking to school in New Delhi, Anant Sudarshan would watch the vultures perched along telephone wires, waiting for the discards of nearby leather tanning factories. So w… [+8439 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "CleanTechnica"
    },
    "author": "Zachary Shahan",
    "title": "Tesla Patent Shows Clear Robotaxi Solutions",
    "description": "Not that anyone needs it, but we’ve got more proof that Tesla is thinking seriously about robotaxi service and trying to prepare its table for that. Tesla has been awarded a patent for automatic cleaning — well, sanitizing — of enclosed spaces (i.e., vehicle …",
    "url": "https://cleantechnica.com/2024/07/06/tesla-patent-shows-clear-robotaxi-solutions/",
    "urlToImage": "https://cleantechnica.com/wp-content/uploads/2024/07/Tesla-robotaxi-self-sanitizing-patent.png",
    "publishedAt": "2024-07-06T12:39:51Z",
    "content": "Sign up for daily news updates from CleanTechnica on email. Or follow us on Google News! Not that anyone needs it, but we’ve got more proof that Tesla is thinking seriously about robotaxi service an… [+3037 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cracked.com"
    },
    "author": "Keegan Kelly",
    "title": "The Top 5 Times ‘It’s Always Sunny in Philadelphia’ Got Meta",
    "description": "The best moments when ‘It’s Always Sunny in Philadelphia’ showed the kind of self-awareness that its characters could never have",
    "url": "https://www.cracked.com/article_42670_the-top-5-times-its-always-sunny-in-philadelphia-got-meta.html",
    "urlToImage": "https://s3.crackedcdn.com/phpimages/article/9/7/1/1103971.jpg",
    "publishedAt": "2024-07-07T14:00:00Z",
    "content": "If the Emmys had an award category for Best Meta Episode in A Sitcom About Psychotic Pennsylvania Bar Owners, theyd still find a way to snub Its Always in Philadelphia. Don't Miss When youre the st… [+3360 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cracked.com"
    },
    "author": "JM McNab",
    "title": "‘Star Trek’ Is Boldly Going Where ‘The Office’ and ‘Parks and Rec’ Have Gone Before",
    "description": "Don’t worry, the ‘Star Trek’ sitcom probably won’t involve William Shatner",
    "url": "https://www.cracked.com/article_43042_star-trek-is-boldly-going-where-the-office-and-parks-and-rec-have-gone-before.html",
    "urlToImage": "https://s3.crackedcdn.com/phpimages/article/3/2/2/1123322.jpg",
    "publishedAt": "2024-07-30T13:30:00Z",
    "content": "For a long time, the world of Star Trek simply wasnt that funny. Sure, there were the occasional moments of humor; the Enterprise becoming overrun with furry alien balls, Checkov asking about Nuclear… [+2844 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Gothamist"
    },
    "author": "Ryan Kailath",
    "title": "Summer in New York City always smells like hot garbage. But this year is even worse.",
    "description": "It's been a stinky summer. A local meteorologist explains why. [ more › ]",
    "url": "https://gothamist.com/arts-entertainment/summer-in-new-york-city-always-smells-like-hot-garbage-but-this-year-is-even-worse",
    "urlToImage": "https://api-prod.gothamist.com/images/346322/fill-1200x650|format-webp|webpquality-85/",
    "publishedAt": "2024-07-25T21:40:00Z",
    "content": "The smell of hot garbage in the morning, evening or afternoon is well-known to anyone whos lived through a New York City summer. But the familiar urban fragrance is especially pronounced and pervasi… [+3434 chars]"
  }
]
