[
{
"source": {
"id": null,
"name": "Gizmodo.com"
},
"author": "Passant Rabie",
"title": "NASA Cancels VIPER’s Trip to the Moon After Spending $450 Million on Rover",
"description": "Cost overruns and delays doomed the ice-hunting lunar rover.",
"url": "https://gizmodo.com/nasa-cancels-vipers-trip-to-the-moon-after-spending-450-million-on-rover-2000476283",
"urlToImage": "https://gizmodo.com/app/uploads/2024/07/viper-rover.jpg",
"publishedAt": "2024-07-18T16:56:35Z",
"content": "NASA’s boxy four-wheeled rover won’t make it to the Moon after all, due to development delays and mounting costs that have apparently pushed the space agency to call off its ice-hunting mission. VIP… [+2492 chars]"
},
{
"source": {
"id": "al-jazeera-english",
"name": "Al Jazeera English"
},
"author": "Erin Hale",
"title": "Nine in 10 top global companies failing to uphold human rights, report says",
"description": "World Benchmarking Alliance says companies should take greater responsibility for UN Sustainable Development Goals.",
"url": "https://www.aljazeera.com/economy/2024/7/2/nine-in-10-top-global-companies-failing-to-uphold-human-rights-report-says",
"urlToImage": "https://www.aljazeera.com/wp-content/uploads/2024/07/AFP__20161130__IL91A__v1__HighRes__IndonesiaEconomyAutoBmw-1719894492.jpg?resize=1920%2C1440",
"publishedAt": "2024-07-02T07:03:24Z",
"content": "More than 90 percent of the worlds 2,000 most influential companies, including Amazon, BMW, Nestle, Rio Tinto, Pfizer, Shein, and Standard Chartered, are failing to meet societal expectations towards… [+4331 chars]"
},
{
"source": {
"id": null,
"name": "Project Syndicate"
},
"author": "John W. McArthur",
"title": "Rebooting the Sustainable Development Goals",
"description": "Despite significant improvements in some areas, the world is still far from achieving most of the Sustainable Development Agenda’s 169 targets. With six years remaining until the 2030 deadline, it is crucial to develop and implement ambitious, inspiring, yet …",
"url": "https://www.project-syndicate.org/commentary/achieving-sdgs-by-2030-requires-innovative-ideas-by-john-w-mcarthur-and-zia-khan-1-2024-07",
"urlToImage": "https://webapi.project-syndicate.org/library/3260dbb2edf31e94f050ac81852c43ee.2-1-super.1.jpg",
"publishedAt": "2024-07-19T13:41:51Z",
"content": "Despite significant improvements in some areas, the world is still far from achieving most of the Sustainable Development Agendas 169 targets. With six years remaining until the 2030 deadline, it is … [+7200 chars]"
},
{
"source": {
"id": null,
"name": "ReadWrite"
},
"author": "Alvin Hemedez",
"title": "New Crypto Launch ‘The Meme Games’ Merges Pepe Coin, Brett And Other Viral Memes",
"description": "As the meme coin market surges past the $50 billion valuation mark once again, a new contender has entered the… Continue reading New Crypto Launch ‘The Meme Games’ Merges Pepe Coin, Brett And Other Viral Memes The post New Crypto Launch ‘The Meme Games’ Merge…",
"url": "https://readwrite.com/new-crypto-launch-the-meme-games-merges-pepe-coin-brett-and-other-viral-memes/",
"urlToImage": "https://readwrite.com/wp-content/uploads/2024/07/new-crypto-launch-the-meme-games-merges-pepe-coin-brett-and-other-viral-memes.jpg",
"publishedAt": "2024-07-18T16:58:02Z",
"content": "As the meme coin market surges past the $50 billion valuation mark once again, a new contender has entered the arena with ambitious goals: The Meme Games. Launched amid fervent anticipation on Septe… [+6341 chars]"
},
{
"source": {
"id": null,
"name": "Gizmodo.com"
},
"author": "George Dvorsky",
"title": "How Small Teams at Intuitive Machines Are Solving Big Lunar Challenges",
"description": "Intuitive Machines CTO Tim Crain spoke to Gizmodo about the new space race and what it will take to return to the Moon.",
"url": "https://gizmodo.com/how-small-teams-at-intuitive-machines-are-solving-big-l-1851561547",
"urlToImage": "https://gizmodo.com/app/uploads/2024/06/ed9830090683d98bfb2e97c764e532c9.jpg",
"publishedAt": "2024-07-05T17:01:38Z",
"content": "Intuitive Machines is fast becoming a key player in the burgeoning era of lunar exploration. Speaking with Gizmodo, CTO Tim Crain discussed how the company is trying to establish a niche in the lunar… [+10159 chars]"
},
{
"source": {
"id": null,
"name": "Harvard Business Review"
},
"author": null,
"title": "Agility Is the Key to a Strong GenAI Strategy - SPONSOR CONTENT FROM AWS",
"description": "Sponsor content from AWS.",
"url": "https://hbr.org/sponsored/2024/07/agility-is-the-key-to-a-strong-genai-strategy",
"urlToImage": "https://hbr.org/resources/images/article_assets/2024/07/AdobeStock_566495404-1.png",
"publishedAt": "2024-07-31T18:26:28Z",
"content": "Sponsor content from AWS. &gt; More and more organizations today are exploring the power of generative AI to drive innovation, boost productivity, and deliver exc… [+6391 chars]"
},
{
"source": {
"id": null,
"name": "Phys.Org"
},
"author": "Bettina Greenwell",
"title": "Efficient water quality management could reduce future water scarcity by half",
"description": "Global water scarcity, a result of both quantity and quality change, challenges the achievement of the Sustainable Development Goals. An international team of researchers has now developed a novel modeling approach to identify cost-effective combinations of w…",
"url": "https://phys.org/news/2024-07-efficient-quality-future-scarcity.html",
"urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/efficient-water-qualit.jpg",
"publishedAt": "2024-07-08T14:17:12Z",
"content": "Global water scarcity, a result of both quantity and quality change, challenges the achievement of the Sustainable Development Goals. An international team of researchers has now developed a novel mo… [+3683 chars]"
},
{
"source": {
"id": null,
"name": "Phys.Org"
},
"author": "Science X",
"title": "Innovative solutions for sustainability in the Zambezi River Basin",
"description": "A new study addresses the urgent challenges in managing the water-energy-land nexus in the Zambezi River Basin, which is crucial for southern Africa's economic stability and environmental health. The authors of the article suggest strategies for economic deve…",
"url": "https://phys.org/news/2024-07-solutions-sustainability-zambezi-river-basin.html",
"urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/innovative-solutions-f.jpg",
"publishedAt": "2024-07-30T12:35:33Z",
"content": "A new study addresses the urgent challenges in managing the water-energy-land nexus in the Zambezi River Basin, which is crucial for southern Africa's economic stability and environmental health. The… [+4335 chars]"
},
{
"source": {
"id": null,
"name": "Opensource.net"
},
"author": "Nicole Martinelli",
"title": "Open Source takes center stage at United Nations",
"description": "The United Nations invited hundreds of nerds to the OSPOS for Good 2024 conference in New York. Here's what happened.",
"url": "https://opensource.net/open-source-takes-center-stage-at-united-nations/",
"urlToImage": "https://150126476.v2.pressablecdn.com/wp-content/uploads/2024/07/IMG_20240709_103325923_HDR-scaled.jpg",
"publishedAt": "2024-07-17T01:57:28Z",
"content": "NEW YORK, UNITED NATIONS HEADQUARTERS Theres a buzz just writing that dateline. A nervous frisson rippled through the two days of OSPOS for Good 2024 when hundreds of participants from across the glo… [+8664 chars]"
},
{
"source": {
"id": null,
"name": "Lifehack.org"
},
"author": "Leon Ho",
"title": "How to Set and Crush Your Goals in 2024: Expert Tips and Examples",
"description": "Ah, 2024. Another year, another set of resolutions gathering dust by February, right? Not this time. Let’s face it – we’ve all been there, setting lofty goals only to watch them fizzle out faster than a New Year’s Eve sparkler. But here’s the kicker: it’s not…",
"url": "https://www.lifehack.org/973173/goals-for-2024",
"urlToImage": "https://cdn.lifehack.org/wp-content/uploads/2024/07/2024_goals.jpg",
"publishedAt": "2024-07-22T18:09:59Z",
"content": "Ah, 2024. Another year, another set of resolutions gathering dust by February, right? Not this time. Let’s face it – we’ve all been there, setting lofty goals only to watch them fizzle out faster tha… [+22276 chars]"
},
{
"source": {
"id": null,
"name": "Forbes"
},
"author": "Fernando Gutierrez, Forbes Councils Member, Fernando Gutierrez, Forbes Councils Member https://www.forbes.com/sites/forbestechcouncil/people/fernandogutierrez/",
"title": "Use Cases: Driving Product Market Fit And Sustainable Growth",
"description": "In my journey as a CEO and tech leader, one principle has consistently proven to be a cornerstone of our success: the meticulous understanding and definition of use cases.",
"url": "https://www.forbes.com/sites/forbestechcouncil/2024/07/31/use-cases-driving-product-market-fit-and-sustainable-growth/",
"urlToImage": "https://imageio.forbes.com/specials-images/imageserve/5fe33b61285ff6033e351c4f/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
"publishedAt": "2024-07-31T14:15:00Z",
"content": "Fernando Gutierrez, CEO of Tachyus. getty In my journey as a CEO and tech leader, one principle has consistently proven to be a cornerstone of our success: the meticulous understanding and definiti… [+5666 chars]"
},
{
"source": {
"id": null,
"name": "Search Engine Journal"
},
"author": "Digitalinear",
"title": "Organic SEO Strategy Guide: How To Boost Search Visibility & Drive Growth via @sejournal, @idigitalinear",
"description": "This post was sponsored by Digitalinear. The opinions expressed in this article are the sponsor’s own. In a world where consumers search online for nearly everything – from product recommendations to local service providers – your brand’s digital presence is …",
"url": "https://www.searchenginejournal.com/organic-seo-strategy-guide-how-to-boost-search-visibility-drive-growth-spa/520888/",
"urlToImage": "https://www.searchenginejournal.com/wp-content/uploads/2024/06/featured-435.jpg",
"publishedAt": "2024-07-05T05:00:46Z",
"content": "This post was sponsored by Digitalinear. The opinions expressed in this article are the sponsor’s own. In a world where consumers search online for nearly everything – from product recommendations t… [+9316 chars]"
},
{
"source": {
"id": null,
"name": "Project Syndicate"
},
"author": "Kevin Watkins",
"title": "How the G20 Could Help Eliminate Hunger and Extreme Poverty",
"description": "In November, the G20 plans to launch the Global Alliance against Hunger and Poverty. Partly modeled on Brazilian President Luiz Inácio Lula da Silva’s “zero-hunger” campaign, this initiative has the potential to revitalize the G20 and put the world back on tr…",
"url": "https://www.project-syndicate.org/commentary/lula-bold-g20-push-to-end-hunger-and-extreme-poverty-by-kevin-watkins-2024-07",
"urlToImage": "https://webapi.project-syndicate.org/library/c173e0eb72fdeccf2bdca28387ab97ee.2-1-super.1.jpg",
"publishedAt": "2024-07-23T16:00:35Z",
"content": "In November, the G20 plans to launch the Global Alliance against Hunger and Poverty. Partly modeled on Brazilian President Luiz Inácio Lula da Silvas zero-hunger campaign, this initiative has the pot… [+7369 chars]"
},
{
"source": {
"id": "die-zeit",
"name": "Die Zeit"
},
"author": "ZEIT ONLINE: News -",
"title": "UN-Ziele: Rot-Grün will Nachhaltigkeitsstrategie für Hamburg",
"description": "Hier finden Sie Informationen zu dem Thema „UN-Ziele“. Lesen Sie jetzt „Rot-Grün will Nachhaltigkeitsstrategie für Hamburg“.",
"url": "https://www.zeit.de/news/2024-07/29/rot-gruen-will-nachhaltigkeitsstrategie-fuer-hamburg",
"urlToImage": "https://img.zeit.de/news/2024-07/29/rot-gruen-will-nachhaltigkeitsstrategie-fuer-hamburg-image-group/wide__1300x731",
"publishedAt": "2024-07-29T03:30:36Z",
"content": "Mit einer Nachhaltigkeitsstrategie für Hamburg wollen SPD und Grüne den Weg zum Erreichen der 17 Nachhaltigkeitsziele der Vereinten Nationen aufzeigen. Das sieht ein gemeinsamer Antrag der Regierungs… [+3766 chars]"
},
{
"source": {
"id": null,
"name": "Foodpolitics.com"
},
"author": "Marion",
"title": "Report on the Sustainable Development Goals’ progress: Not much, alas.",
"description": "I’m always interested in the latest updates on progress toward the Sustainable Development Goals. 17 Goals to Transform Our World: The Sustainable Development Goals are a call for action by all countries – poor, rich and middle-income – to promote prosperity …",
"url": "https://www.foodpolitics.com/2024/07/report-on-the-sustainable-development-goals-progress-not-much-alas/",
"urlToImage": "https://www.foodpolitics.com/wp-content/uploads/Capture-135-500x705.jpg",
"publishedAt": "2024-07-23T13:00:40Z",
"content": "I’m always interested in the latest updates on progress toward the Sustainable Development Goals. 17 Goals to Transform Our World: The Sustainable Development Goals are a call for action by all coun… [+2078 chars]"
},
{
"source": {
"id": null,
"name": "NASA"
},
"author": "Tiernan P. Doyle",
"title": "NASA Deputy Administrator Strengthens Ties in Japan, Republic of Korea",
"description": "NASA Deputy Administrator Pam Melroy will visit Japan and the Republic of Korea beginning Thursday, July 11 to underscore the critical role of international cooperation in advancing space exploration and technology development. During her week-long visit to t…",
"url": "https://www.nasa.gov/news-release/nasa-deputy-administrator-strengthens-ties-in-japan-republic-of-korea/",
"urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/04/51983736352-38e07c3d5f-o.jpg",
"publishedAt": "2024-07-10T16:21:49Z",
"content": "NASA Deputy Administrator Pam Melroy will visit Japan and the Republic of Korea beginning Thursday, July 11, to underscore the critical role of international cooperation in advancing space exploratio… [+1698 chars]"
},
{
"source": {
"id": null,
"name": "Phys.Org"
},
"author": "Joe Stafford",
"title": "Land protection initiatives reduced Amazon deforestation by up to 83%, new analysis finds",
"description": "A new analysis shows that land protection initiatives in the Brazilian Legal Amazon (BLA) reduced deforestation by up to 83% between 2000 and 2010. Such impressive results highlight the vital role of land protection policies in achieving ambitious goals, incl…",
"url": "https://phys.org/news/2024-07-amazon-deforestation-analysis.html",
"urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/land-protection-initia.jpg",
"publishedAt": "2024-07-15T17:14:40Z",
"content": "A new analysis shows that land protection initiatives in the Brazilian Legal Amazon (BLA) reduced deforestation by up to 83% between 2000 and 2010. Such impressive results highlight the vital role of… [+4592 chars]"
},
{
"source": {
"id": null,
"name": "Forbes"
},
"author": "David Balaban, Contributor, David Balaban, Contributor https://www.forbes.com/sites/davidbalaban/",
"title": "The Future Of Cybersecurity In A Net-Zero World",
"description": "Discover how the race towards net-zero carbon emissions transforms cybersecurity. Learn strategies to secure sustainable infrastructures and prevent disruptions.",
"url": "https://www.forbes.com/sites/davidbalaban/2024/07/21/the-future-of-cybersecurity-in-a-net-zero-world/",
"urlToImage": "https://imageio.forbes.com/specials-images/imageserve/669ccc1ba1242e7d20052448/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
"publishedAt": "2024-07-21T08:56:28Z",
"content": "Environmental technology concept. Sustainable development goals. SDGs. getty As the world races towards achieving net-zero carbon emissions, a profound transformation is underway across various sec… [+6849 chars]"
},
{
"source": {
"id": null,
"name": "Springwise.com"
},
"author": "Matthew Hempstead",
"title": "Revolutionising maternity care in Africa",
"description": "These hybrid, personalised care packages help parents before, during, and after the birth",
"url": "https://www.springwise.com/innovation/health-wellbeing/revolutionising-maternity-care-in-africa/",
"urlToImage": "https://www.springwise.com/wp-content/uploads/2024/07/innovationhealth-wellbeingrevolutionising-maternity-care-in-Africa.jpg",
"publishedAt": "2024-07-31T04:55:00Z",
"content": "Spotted: One of the targets under the United Nations Sustainable Development Goals is to reduce the global maternal mortality ratio to less than 70 per 100,000 live births. Hoping to support that goa… [+1380 chars]"
},
{
"source": {
"id": null,
"name": "Forbes"
},
"author": "Stefano Carganico, Forbes Councils Member, Stefano Carganico, Forbes Councils Member https://www.forbes.com/sites/forbesbusinessdevelopmentcouncil/people/stefanocarganico/",
"title": "Sustainable Cost Transformation",
"description": "The complexity of organizational structure and achieving lean, lightweight operations are within the reach of all buyers along the value chain.",
"url": "https://www.forbes.com/sites/forbesbusinessdevelopmentcouncil/2024/07/11/sustainable-cost-transformation/",
"urlToImage": "https://imageio.forbes.com/specials-images/imageserve/64f247743975a6c45285cc97/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
"publishedAt": "2024-07-11T11:00:00Z",
"content": "Stefano Carganico, Partner and VP Sales Global and Head of Subsidiaries at PQE Group. getty To think of a business as a rocket ship is a good comparison for describing the way a company can create … [+6097 chars]"
}
]